xiongGithub1/autosarTc234/Applications/SipAddon/tc234Autosar/MCAL/general/tricore/inc/TC23x/IfxEth_regdef.h
/**
 * \file IfxEth_regdef.h
 * \brief
 * \copyright Copyright (c) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC23XADAS_UM_V1.1.R1
 * Specification: tc23xadas_um_sfrs_MCSFR.xml (Revision: UM_V1.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Eth Eth
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Eth_Bitfields Bitfields
 * \ingroup IfxLld_Eth
 * 
 * \defgroup IfxLld_Eth_union Union
 * \ingroup IfxLld_Eth
 * 
 * \defgroup IfxLld_Eth_struct Struct
 * \ingroup IfxLld_Eth
 * 
 */
#ifndef IFXETH_REGDEF_H
#define IFXETH_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Eth_Bitfields
 * \{  */

/** \brief  Access Enable Register 0 */
typedef struct _Ifx_ETH_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID 0 (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID 1 (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID 2 (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID 3 (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID 4 (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID 5 (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID 6 (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID 7 (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID 8 (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID 9 (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID 10 (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID 11 (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID 12 (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID 13 (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID 14 (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID 15 (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID 16 (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID 17 (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID 18 (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID 19 (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID 20 (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID 21 (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID 22 (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID 23 (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID 24 (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID 25 (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID 26 (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID 27 (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID 28 (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID 29 (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID 30 (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID 31 (rw) */
} Ifx_ETH_ACCEN0_Bits;

/** \brief  Access Enable Register 1 */
typedef struct _Ifx_ETH_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_ETH_ACCEN1_Bits;

/** \brief  Register 11 - AHB or AXI Status Register */
typedef struct _Ifx_ETH_AHB_OR_AXI_STATUS_Bits
{
    unsigned int AXWHSTS:1;                 /**< \brief [0:0] AXI Master Write Channel or AHB Master Status (r) */
    unsigned int AXIRDSTS:1;                /**< \brief [1:1] AXI Master Read Channel Status (r) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_ETH_AHB_OR_AXI_STATUS_Bits;

/** \brief  Register 0 - Bus Mode Register */
typedef struct _Ifx_ETH_BUS_MODE_Bits
{
    unsigned int SWR:1;                     /**< \brief [0:0] Software Reset (rw) */
    unsigned int DA:1;                      /**< \brief [1:1] DMA Arbitration Scheme (rw) */
    unsigned int DSL:5;                     /**< \brief [6:2] Descriptor Skip Length (rw) */
    unsigned int ATDS:1;                    /**< \brief [7:7] Alternate Descriptor Size (rw) */
    unsigned int PBL:6;                     /**< \brief [13:8] Programmable Burst Length (rw) */
    unsigned int PR:2;                      /**< \brief [15:14] Priority Ratio (rw) */
    unsigned int FB:1;                      /**< \brief [16:16] Fixed Burst (rw) */
    unsigned int RPBL:6;                    /**< \brief [22:17] Rx DMA PBL (rw) */
    unsigned int USP:1;                     /**< \brief [23:23] Use Seperate PBL (rw) */
    unsigned int PBLx8:1;                   /**< \brief [24:24] PBLx8 Mode (rw) */
    unsigned int AAL:1;                     /**< \brief [25:25] Address Aligned Beats (rw) */
    unsigned int MB:1;                      /**< \brief [26:26] Mixed Burst (rw) */
    unsigned int TXPR:1;                    /**< \brief [27:27] Transmit Priority (rw) */
    unsigned int PRWG:2;                    /**< \brief [29:28] Channel Priority Weights (r) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ETH_BUS_MODE_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_ETH_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_ETH_CLC_Bits;

/** \brief  Register 21 - Current Host Receive Buffer Address Register */
typedef struct _Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits
{
    unsigned int CURRBUFAPTR:32;            /**< \brief [31:0] Host Receive Buffer Address Pointer (r) */
} Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits;

/** \brief  Register 19 - Current Host Receive Descriptor Register */
typedef struct _Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits
{
    unsigned int CURRDESAPTR:32;            /**< \brief [31:0] Host Receive Descriptor Address Pointer (r) */
} Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits;

/** \brief  Register 20 - Current Host Transmit Buffer Address Register */
typedef struct _Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits
{
    unsigned int CURTBUFAPTR:32;            /**< \brief [31:0] Host Transmit Buffer Address Pointer (r) */
} Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits;

/** \brief  Register 18 - Current Host Transmit Descriptor Register */
typedef struct _Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits
{
    unsigned int CURTDESAPTR:32;            /**< \brief [31:0] Host Transmit Descriptor Address Pointer (r) */
} Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits;

/** \brief  Register 9 - Debug Register */
typedef struct _Ifx_ETH_DEBUG_Bits
{
    unsigned int RPESTS:1;                  /**< \brief [0:0] MAC GMII or MII Receive Protocol Engine Status (r) */
    unsigned int RFCFCSTS:2;                /**< \brief [2:1] MAC Receive Frame Controller FIFO Status (r) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int RWCSTS:1;                  /**< \brief [4:4] MTL Rx FIFO Write Controller Active Status (r) */
    unsigned int RRCSTS:2;                  /**< \brief [6:5] MTL Rx FIFO Read Controller State (r) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int RXFSTS:2;                  /**< \brief [9:8] MTL Rx FIFO Fill-level Status (r) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int TPESTS:1;                  /**< \brief [16:16] MAC GMII or MII Transmit Protocol Engine Status (r) */
    unsigned int TFCSTS:2;                  /**< \brief [18:17] MAC Transmit Frame Controller Status (r) */
    unsigned int TXPAUSED:1;                /**< \brief [19:19] MAC transmitter in PAUSE (r) */
    unsigned int TRCSTS:2;                  /**< \brief [21:20] MTL Tx FIFO Read Controller Status (r) */
    unsigned int TWCSTS:1;                  /**< \brief [22:22] MTL Tx FIFO Write Controller Active Status (r) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int TXFSTS:1;                  /**< \brief [24:24] MTL Tx FIFO Not Empty Status (r) */
    unsigned int TXSTSFSTS:1;               /**< \brief [25:25] MTL TxStatus FIFO Full Status (r) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ETH_DEBUG_Bits;

/** \brief  Register 6 - Flow Control Register */
typedef struct _Ifx_ETH_FLOW_CONTROL_Bits
{
    unsigned int FCA_BPA:1;                 /**< \brief [0:0] Flow Control Busy or Backpressure Activate (rw) */
    unsigned int TFE:1;                     /**< \brief [1:1] Transmit Flow Control Enable (rw) */
    unsigned int RFE:1;                     /**< \brief [2:2] Receive Flow Control Enable (rw) */
    unsigned int UP:1;                      /**< \brief [3:3] Unicast Pause Frame Detect (rw) */
    unsigned int PLT:2;                     /**< \brief [5:4] Pause Low Threshold (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int DZPQ:1;                    /**< \brief [7:7] Disable Zero-Quanta Pause (rw) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int PT:16;                     /**< \brief [31:16] Pause Time (rw) */
} Ifx_ETH_FLOW_CONTROL_Bits;

