xiongGithub1/autosarTc234/Applications/SipAddon/tc234Autosar/MCAL/general/tricore/inc/TC23x/IfxEth_regdef.h
/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_ACCEN1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ETH_ACCEN1;

/** \brief  Register 11 - AHB or AXI Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_AHB_OR_AXI_STATUS_Bits B;       /**< \brief Bitfield access */
} Ifx_ETH_AHB_OR_AXI_STATUS;

/** \brief  Register 0 - Bus Mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_BUS_MODE_Bits B;                /**< \brief Bitfield access */
} Ifx_ETH_BUS_MODE;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_CLC_Bits B;                     /**< \brief Bitfield access */
} Ifx_ETH_CLC;

/** \brief  Register 21 - Current Host Receive Buffer Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS;

/** \brief  Register 19 - Current Host Receive Descriptor Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR;

/** \brief  Register 20 - Current Host Transmit Buffer Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS;

/** \brief  Register 18 - Current Host Transmit Descriptor Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR;

/** \brief  Register 9 - Debug Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_DEBUG_Bits B;                   /**< \brief Bitfield access */
} Ifx_ETH_DEBUG;

/** \brief  Register 6 - Flow Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_FLOW_CONTROL_Bits B;            /**< \brief Bitfield access */
} Ifx_ETH_FLOW_CONTROL;

/** \brief  Register 4 - GMII Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_GMII_ADDRESS_Bits B;            /**< \brief Bitfield access */
} Ifx_ETH_GMII_ADDRESS;

/** \brief  Register 5 - GMII Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_GMII_DATA_Bits B;               /**< \brief Bitfield access */
} Ifx_ETH_GMII_DATA;

/** \brief  Input and Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_GPCTL_Bits B;                   /**< \brief Bitfield access */
} Ifx_ETH_GPCTL;

/** \brief  Register 2 - Hash Table High Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_HASH_TABLE_HIGH_Bits B;         /**< \brief Bitfield access */
} Ifx_ETH_HASH_TABLE_HIGH;

/** \brief  Register 3 - Hash Table Low Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_HASH_TABLE_LOW_Bits B;          /**< \brief Bitfield access */
} Ifx_ETH_HASH_TABLE_LOW;

/** \brief  Register 22 - HW Feature Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_HW_FEATURE_Bits B;              /**< \brief Bitfield access */
} Ifx_ETH_HW_FEATURE;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_ETH_ID;

/** \brief  Register 7 - Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_INTERRUPT_ENABLE_Bits B;        /**< \brief Bitfield access */
} Ifx_ETH_INTERRUPT_ENABLE;

/** \brief  Register 15 - Interrupt Mask Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_INTERRUPT_MASK_Bits B;          /**< \brief Bitfield access */
} Ifx_ETH_INTERRUPT_MASK;

/** \brief  Register 14 - Interrupt Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_INTERRUPT_STATUS_Bits B;        /**< \brief Bitfield access */
} Ifx_ETH_INTERRUPT_STATUS;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_KRST0_Bits B;                   /**< \brief Bitfield access */
} Ifx_ETH_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_KRST1_Bits B;                   /**< \brief Bitfield access */
} Ifx_ETH_KRST1;

