xiongGithub1/autosarTc234/Applications/SipAddon/tc234Autosar/MCAL/general/tricore/inc/TC23x/IfxEth_regdef.h
/** \brief  Register 103 - Receive Frame Count for Runt Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RX_RUNT_ERROR_FRAMES;

/** \brief  Register 105 - Receive Frame Count for Undersize Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD;

/** \brief  Register 113 - Receive Frame Count for Good Unicast Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RX_UNICAST_FRAMES_GOOD;

/** \brief  Register 118 - Receive Frame Count for Good and Bad VLAN Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD;

/** \brief  Register 119 - Receive Frame Count for Watchdog Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES;

/** \brief  Register 145 - Receive ICMP Error Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXICMP_ERROR_FRAMES_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_RXICMP_ERROR_FRAMES;

/** \brief  Register 161 - Receive ICMP Error Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXICMP_ERROR_OCTETS_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_RXICMP_ERROR_OCTETS;

/** \brief  Register 144 - Receive ICMP Good Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXICMP_GOOD_FRAMES_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXICMP_GOOD_FRAMES;

/** \brief  Register 160 - Receive ICMP Good Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXICMP_GOOD_OCTETS_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXICMP_GOOD_OCTETS;

/** \brief  Register 135 - Receive IPV4 Fragmented Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES;

/** \brief  Register 151 - Receive IPV4 Fragmented Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS;

/** \brief  Register 132 - Receive IPV4 Good Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_GOOD_FRAMES;

/** \brief  Register 148 - Receive IPV4 Good Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_GOOD_OCTETS;

/** \brief  Register 133 - Receive IPV4 Header Error Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES;

/** \brief  Register 149 - Receive IPV4 Header Error Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS;

/** \brief  Register 134 - Receive IPV4 No Payload Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES;

/** \brief  Register 150 - Receive IPV4 No Payload Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS;

/** \brief  Register 152 - Receive IPV4 Fragmented Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS;

/** \brief  Register 136 - Receive IPV4 UDP Checksum Disabled Frame Counter
 * Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES;

/** \brief  Register 137 - Receive IPV6 Good Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXIPV6_GOOD_FRAMES;

/** \brief  Register 153 - Receive IPV6 Good Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXIPV6_GOOD_OCTETS;

