xiongGithub1/autosarTc234/Applications/SipAddon/tc234Autosar/MCAL/general/tricore/inc/TC23x/IfxEth_regdef.h
/** \brief  Register 138 - Receive IPV6 Header Error Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES;

/** \brief  Register 154 - Receive IPV6 Header Error Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS;

/** \brief  Register 139 - Receive IPV6 No Payload Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES;

/** \brief  Register 155 - Receive IPV6 No Payload Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS;

/** \brief  Register 143 - Receive TCP Error Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXTCP_ERROR_FRAMES_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXTCP_ERROR_FRAMES;

/** \brief  Register 159 - Receive TCP Error Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXTCP_ERROR_OCTETS_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXTCP_ERROR_OCTETS;

/** \brief  Register 142 - Receive TCP Good Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXTCP_GOOD_FRAMES_Bits B;       /**< \brief Bitfield access */
} Ifx_ETH_RXTCP_GOOD_FRAMES;

/** \brief  Register 158 - Receive TCP Good Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXTCP_GOOD_OCTETS_Bits B;       /**< \brief Bitfield access */
} Ifx_ETH_RXTCP_GOOD_OCTETS;

/** \brief  Register 141 - Receive UDP Error Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXUDP_ERROR_FRAMES_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXUDP_ERROR_FRAMES;

/** \brief  Register 157 - Receive UDP Error Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXUDP_ERROR_OCTETS_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_RXUDP_ERROR_OCTETS;

/** \brief  Register 140 - Receive UDP Good Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXUDP_GOOD_FRAMES_Bits B;       /**< \brief Bitfield access */
} Ifx_ETH_RXUDP_GOOD_FRAMES;

/** \brief  Register 156 - Receive UDP Good Octet Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RXUDP_GOOD_OCTETS_Bits B;       /**< \brief Bitfield access */
} Ifx_ETH_RXUDP_GOOD_OCTETS;

/** \brief  Register 5 - Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_STATUS_Bits B;                  /**< \brief Bitfield access */
} Ifx_ETH_STATUS;

/** \brief  Register 449 - Sub-Second Increment Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_SUB_SECOND_INCREMENT_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_SUB_SECOND_INCREMENT;

/** \brief  Register 457 - System Time - Higher Word Seconds Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS;

/** \brief  Register 451 - System Time - Nanoseconds Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_SYSTEM_TIME_NANOSECONDS;

/** \brief  Register 453 - System Time - Nanoseconds Update Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE;

/** \brief  Register 450 - System Time - Seconds Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_SYSTEM_TIME_SECONDS_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_SYSTEM_TIME_SECONDS;

/** \brief  Register 452 - System Time - Seconds Update Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE;

