xiongGithub1/autosarTc234/Applications/SipAddon/tc234Autosar/MCAL/general/tricore/inc/TC23x/IfxEth_regdef.h
    Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER;  /**< \brief 2020, Register 8 - Missed Frame and Buffer Overflow Counter Register */
    Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER RECEIVE_INTERRUPT_WATCHDOG_TIMER;  /**< \brief 2024, Register 9 - Receive Interrupt Watchdog Timer Register */
    unsigned char reserved_2028[4];         /**< \brief 2028, \internal Reserved */
    Ifx_ETH_AHB_OR_AXI_STATUS AHB_OR_AXI_STATUS;    /**< \brief 202C, Register 11 - AHB or AXI Status Register */
    unsigned char reserved_2030[24];        /**< \brief 2030, \internal Reserved */
    Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR CURRENT_HOST_TRANSMIT_DESCRIPTOR;  /**< \brief 2048, Register 18 - Current Host Transmit Descriptor Register */
    Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR CURRENT_HOST_RECEIVE_DESCRIPTOR;    /**< \brief 204C, Register 19 - Current Host Receive Descriptor Register */
    Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS;  /**< \brief 2050, Register 20 - Current Host Transmit Buffer Address Register */
    Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS CURRENT_HOST_RECEIVE_BUFFER_ADDRESS;    /**< \brief 2054, Register 21 - Current Host Receive Buffer Address Register */
    Ifx_ETH_HW_FEATURE HW_FEATURE;          /**< \brief 2058, Register 22 - HW Feature Register */
    unsigned char reserved_205C[164];       /**< \brief 205C, \internal Reserved */
} Ifx_ETH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXETH_REGDEF_H */
